USE EmployeeRegistrator;

INSERT INTO Departments
  (Name, DeletedAtUtc)
VALUES
  ('Отдел маркетинга', NULL),
  ('Отдел разработки', NULL);

INSERT INTO Employees
  (FirstName, Surname, Patronymic, WorkplacePresenceRequired, PersonnelNumber, DepartmentId, DeletedAtUtc)
VALUES
  ('Иван', 'Иванов', 'Иванович', TRUE, 1, 1, NULL),
  ('Петр', 'Петров', 'Петрович', FALSE, 2, 1, NULL),
  ('Сидор', 'Сидоров', 'Сидорович', TRUE, 3, 2, NULL),
  ('Владимир', 'Владимиров', 'Владимирович', TRUE, 4, 2, NULL);

INSERT INTO buildings
  (Address, DeletedAtUtc)
VALUES
  ('Бульвар Гагарина, 37а', NULL),
  ('Студенческая, 38', NULL);

INSERT INTO entrances
  (Name, DeletedAtUtc, BuildingId)
VALUES
  ('Главный вход', NULL, 1),
  ('Главный вход', NULL, 2),
  ('Вход с торца', NULL, 2);

-- admin 12345678
-- manager 12345678
-- guard 12345678
INSERT INTO Users
  (Login, Password_Hash, Password_Salt, Role, Email, NeedNotify, DepartmentId, EntranceId)
VALUES
  ('admin', 0x55F3E83D9D8F50A2481487B562511F261556894B6AD6B563D6F32547C017FD22, 0x4CC7C0212EAC253FC5CFA6A40D9E77C7E26F25D452642A34FD18C389050509EB7E1611CB7C8967BA, 1, '89194485838@mail.ru', TRUE, NULL, NULL),
  ('manager', 0x55F3E83D9D8F50A2481487B562511F261556894B6AD6B563D6F32547C017FD22, 0x4CC7C0212EAC253FC5CFA6A40D9E77C7E26F25D452642A34FD18C389050509EB7E1611CB7C8967BA, 2, '89194485838@mail.ru', FALSE, 1, NULL),
  ('guard', 0x55F3E83D9D8F50A2481487B562511F261556894B6AD6B563D6F32547C017FD22, 0x4CC7C0212EAC253FC5CFA6A40D9E77C7E26F25D452642A34FD18C389050509EB7E1611CB7C8967BA, 3, '89194485838@mail.ru', FALSE, NULL, 1);

-- Иванов (Ходит редко и без опозданий)
INSERT INTO Registrations
  (DateTime, EmployeeId, EventType, EntranceId)
VALUES
  -- Пн
  ('2019-03-25 09:55:00', 1, 1, 1),
  ('2019-03-25 17:56:00', 1, 2, 1),

  -- Вт
  ('2019-03-26 09:59:00', 1, 1, 1),
  ('2019-03-26 18:01:00', 1, 2, 1),

  -- Ср
  ('2019-03-27 10:05:00', 1, 1, 1),
  ('2019-03-27 18:24:00', 1, 2, 1),

  -- Чт
  ('2019-03-28 09:57:00', 1, 1, 1),
  ('2019-03-28 17:59:00', 1, 2, 1),

  -- Пт
  ('2019-03-29 09:54:00', 1, 1, 1),
  ('2019-03-29 18:04:00', 1, 2, 1);


-- Петров (Ходит часто, с опозданиями, присутствие необязательно)
INSERT INTO Registrations
  (DateTime, EmployeeId, EventType, EntranceId)
VALUES
  -- Пн
  ('2019-03-25 11:09:00', 2, 1, 1),
  ('2019-03-25 13:03:00', 2, 2, 1),
  ('2019-03-25 13:17:00', 2, 1, 1),
  ('2019-03-25 16:35:00', 2, 2, 1),
  ('2019-03-25 16:59:00', 2, 1, 1),
  ('2019-03-25 19:01:00', 2, 2, 1),

  -- Вт
  ('2019-03-26 11:31:00', 2, 1, 1),
  ('2019-03-26 15:53:00', 2, 2, 1),
  ('2019-03-26 16:59:00', 2, 1, 1),
  ('2019-03-26 19:03:00', 2, 2, 1),

  -- Ср
  ('2019-03-27 09:55:00', 2, 1, 1),
  ('2019-03-27 11:03:00', 2, 2, 1),
  ('2019-03-27 11:21:00', 2, 1, 1),
  ('2019-03-27 16:40:00', 2, 2, 1),
  ('2019-03-27 16:59:00', 2, 1, 1),
  ('2019-03-27 18:01:00', 2, 2, 1),

  -- Чт
  ('2019-03-28 09:57:00', 2, 1, 1),
  ('2019-03-28 14:00:00', 2, 2, 1),
  ('2019-03-28 14:57:00', 2, 1, 1),
  ('2019-03-28 18:01:00', 2, 2, 1),

  -- Пт
  ('2019-03-29 10:07:00', 2, 1, 1),
  ('2019-03-29 13:04:00', 2, 2, 1),
  ('2019-03-29 14:35:00', 2, 1, 1),
  ('2019-03-29 17:59:00', 2, 2, 1);

-- Сидоров (Ходит часто, с опозданиями, присутствие обязательно)
INSERT INTO Registrations
  (DateTime, EmployeeId, EventType, EntranceId)
VALUES
  -- Пн
  ('2019-03-25 11:07:00', 3, 1, 1),
  ('2019-03-25 13:01:00', 3, 2, 1),
  ('2019-03-25 13:19:00', 3, 1, 1),
  ('2019-03-25 16:31:00', 3, 2, 1),
  ('2019-03-25 16:50:00', 3, 1, 1),
  ('2019-03-25 19:04:00', 3, 2, 1),

  -- Вт
  ('2019-03-26 11:30:00', 3, 1, 1),
  ('2019-03-26 15:57:00', 3, 2, 1),
  ('2019-03-26 16:59:00', 3, 1, 1),
  ('2019-03-26 19:04:00', 3, 2, 1),

  -- Ср
  ('2019-03-27 09:54:00', 3, 1, 1),
  ('2019-03-27 11:01:00', 3, 2, 1),
  ('2019-03-27 11:28:00', 3, 1, 1),
  ('2019-03-27 16:44:00', 3, 2, 1),
  ('2019-03-27 16:55:00', 3, 1, 1),
  ('2019-03-27 18:02:00', 3, 2, 1),

  -- Чт
  ('2019-03-28 09:55:00', 3, 1, 1),
  ('2019-03-28 14:05:00', 3, 2, 1),
  ('2019-03-28 14:51:00', 3, 1, 1),
  ('2019-03-28 18:05:00', 3, 2, 1),

  -- Пт
  ('2019-03-29 10:02:00', 3, 1, 1),
  ('2019-03-29 13:03:00', 3, 2, 1),
  ('2019-03-29 14:37:00', 3, 1, 1),
  ('2019-03-29 17:50:00', 3, 2, 1);

-- Владимир Владимирович (Ходит редко, с без опозданий, иногда через окно)
INSERT INTO Registrations
  (DateTime, EmployeeId, EventType, EntranceId)
VALUES
  -- Пн
  ('2019-03-25 10:00:00', 4, 1, 1),
  ('2019-03-25 13:01:00', 4, 1, 1),
  ('2019-03-25 19:04:00', 4, 2, 1),

  -- Вт
  ('2019-03-26 09:57:00', 4, 1, 1),
  ('2019-03-26 19:57:00', 4, 2, 1),

  -- Ср
  ('2019-03-27 09:54:00', 4, 1, 1),
  ('2019-03-27 11:01:00', 4, 2, 1),
  ('2019-03-27 11:37:00', 4, 2, 1),
  ('2019-03-27 11:59:00', 4, 2, 1),
  ('2019-03-27 12:28:00', 4, 1, 1),
  ('2019-03-27 16:44:00', 4, 2, 1),
  ('2019-03-27 16:55:00', 4, 1, 1),
  ('2019-03-27 18:02:00', 4, 2, 1),

  -- Чт
  ('2019-03-28 09:55:00', 4, 1, 1),
  ('2019-03-28 14:05:00', 4, 2, 1),
  ('2019-03-28 14:51:00', 4, 1, 1),
  ('2019-03-28 18:05:00', 4, 2, 1),

  -- Пт
  ('2019-03-29 10:02:00', 4, 1, 1),
  ('2019-03-29 13:03:00', 4, 2, 1),
  ('2019-03-29 14:37:00', 4, 1, 1),
  ('2019-03-29 17:50:00', 4, 2, 1);